<?php

namespace Database\Seeders;

use App\Models\City;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class CitiesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $array = array(
            'Абакан',
            'Адлер',
            'Анапа',
            'Архангельск',
            'Астрахань',
            'Байкал',
            'Барнаул',
            'Бегишево',
            'Белгород',
            'Благовещенск',
            'Большое Савино',
            'Брянск',
            'Бугульмы',
            'Великий Устюг',
            'Владивосток',
            'Владикавказ',
            'Владимир',
            'Внуково',
            'Волгоград',
            'Вологда',
            'Воркута',
            'Воронеж',
            'Геленджик',
            'Горно-Алтайск',
            'Грозный',
            'Домодедово',
            'Елизово',
            'Жуковский',
            'Иваново',
            'Ижевск',
            'Иркутск',
            'Йошкар-Ола',
            'Казань',
            'Калуга',
            'Кировск',
            'Кольцово',
            'Кострома',
            'Котлас',
            'Краснодар',
            'Красноярск',
            'Курган',
            'Курск',
            'Курумоч',
            'Кызыл',
            'Липецк',
            'Магас',
            'Магнитогорск',
            'Махачкала',
            'Минеральных Вод',
            'Мурманск',
            'Нальчик',
            'Нижневартовск',
            'Нижний Новгород',
            'Новый Уренгой',
            'Новокузнецк',
            'Омск',
            'Оренбург',
            'Орск',
            'Пенза',
            'Петрозаводск',
            'Победилово',
            'Псков',
            'Пулково',
            'Ростов-на-Дону',
            'Рощино',
            'Салехард',
            'Саранск',
            'Саратов',
            'Севастополь',
            'Симферополь',
            'Соловков',
            'Ставрополь',
            'Сургут',
            'Сыктывкар',
            'Тамбов',
            'Толмачево',
            'Томск',
            'Туношн',
            'Улан-Удэ',
            'Уфа',
            'Хабаровск',
            'Ханты-Мансийск',
            'Храброво',
            'Чебоксар',
            'Челябинск',
            'Череповец',
            'Чита',
            'Шереметьево',
            'Элиста',
            'Южно-Сахалинск',
            'Южный',
            'Якутск'
        );
        foreach ($array as $i)
        {
            City::insert([
                'name' => $i,
            ]);
        }
    }
}
